app/Http/Controllers/Auth/LoginController.php

    public function studentLogin(StudentLoginRequest $request)
    {

        $student = Student::where('email', $request->email)->first();
---
select * from `students` where `email` = 'hady@hady.com' and `students`.`deleted_at` is null limit 1