app/Http/Resources/SessionResource.php

    public function toArray($request)
    {
        $student = Student::where('id', auth('api')->id())->first();
---
select * from `students` where `id` = 1 and `students`.`deleted_at` is null limit 1