app/Http/Controllers/API/V1/CareerCoachingController.php

select * from `coaches` where `coaches`.`deleted_at` is null
---
    public function getAllCoaches()
    {
        $coaches = Coach::all();