app/Http/Controllers/CompanyInternshipPostController.php

select * from `internship_posts` where `post_type` = 'companyPost' and `internship_posts`.`deleted_at` is null
---
    public function index()
    {
        $companyInternshipPosts = InternshipPost::where('post_type', 'companyPost')->get();

select * from `internship_posts` where `id` = '132' and `internship_posts`.`deleted_at` is null limit 1
---
    public function show($id)
    {
        $intern =  InternshipPost::where('id', $id)->first();

select * from `students` where `id` = '5' and `students`.`deleted_at` is null limit 1
select * from `students` where `id` = '13' and `students`.`deleted_at` is null limit 1
---
    public function acceptStudent()
    {
        $student = Student::where('id', $_GET['s'])->first();
        foreach ($student->applications as $application) {
            if ($application->pivot->student_id == $student->id && $application->pivot->internship_post_id == $_GET['p']) {
                $student->applications()->updateExistingPivot($_GET['p'], ['application_status' => "accepted"]);
                $student->notifications()->firstOrCreate([
                    'student_id' => $student->id,
                    'internship_post_id' => $application->pivot->internship_post_id,
                    'category' => "success",
                    'message' => "Congratulations you got accepted in the applied internship",
                    'type' => "internship",
                    'seen' => false
                ]);

select * from `students` where `id` = '11' and `students`.`deleted_at` is null limit 1
---
    public function rejectStudent()
    {
        $student = Student::where('id', $_GET['s'])->first();
        if ($student) {
            foreach ($student->applications as $application) {
                if ($application->pivot->student_id == $student->id && $application->pivot->internship_post_id == $_GET['p']) {
                    $student->applications()->updateExistingPivot($_GET['p'], ['application_status' => "rejected"]);
                    $student->notifications()->firstOrCreate([
                        'student_id' => $student->id,
                        'internship_post_id' => $application->pivot->internship_post_id,
                        'category' => "rejected",
                        'message' => "Unfortunately, you were rejected in the applied internship",
                        'type' => "internship",
                        'seen' => false
                    ]);