app/Http/Controllers/HomeController.php

select count(*) as aggregate from `student_internship_post_apply`
select count(*) as aggregate from `student_internship_post_apply` where `application_status` = 'accepted'
---
    public function index()
    {
        $posts = InternshipPost::all()->count();
        $students = Student::all()->count();
        $applied = DB::table('student_internship_post_apply')->count();
        $accepted = DB::table('student_internship_post_apply')->where('application_status', 'accepted')->count();