app/Http/Controllers/TrainingAdvisorPostsController.php

select * from `internship_posts` where `post_type` = 'advisorPost' and `internship_posts`.`deleted_at` is null
---
    public function index()
    {
        $advisorInternship = InternshipPost::where('post_type', 'advisorPost')->get();

select * from `internship_posts` where `id` = '102' and `internship_posts`.`deleted_at` is null limit 1
---
    public function show($id)
    {
        $intern =  InternshipPost::where('id', $id)->first();